package me.zonglun.AutumnRecruitment.FireHome;

/**
 * 士兵队列
 *
 * @author : Administrator
 * @create 2018-09-09 15:26
 * @subject :
 * 一队士兵在操场上排成一列，士兵总数为n，每个士兵有各自的身高。
 * <p>
 * 士兵列队完毕后，将军走到队列的最前面。因为身高不一，有些士兵可能被前面身高更高的挡住了，这样将军就看不到他们。
 * 将军能看到某个士兵当且仅当他的身高严格大于他前面的所有士兵。
 * <p>
 * 将军发现这些士兵的身高为a1,a2,a3,...,an。
 * 而且他恰好能看到m个士兵。将军想知道一共有多少种可能的站队方式。两种站队方式不同当且仅当至少存在一个士兵，他站在了队列的不同位置。最后方案数可能很大，输出方案数除以1000000007后的余数。
 * <p>
 * <p>
 * 输入
 * 输入只有两行，第一行两个数n和m，（1<=m<=n<=1000）第二行有n个数，a1到an。（1<=ai<=1000000000）
 * 样例输入
 * 4 3
 * <p>
 * 1 1 2 3
 * 输出
 * 输出一行，问题的答案。
 * 样例输出
 * 6
 */
public class Soldierqueue {

    public static void main(String[] args) {

    }
}
